apples=int(input("Введи кол-во яблок (кг): "))

колвокорицы=apples*20
#на 1кг яблок нужно 20грамм корицы
ценакорицы=колвокорицы/10*0.40
#цена корицы 40 центов за 10 грамм
колвосахар=apples*300
#на 1кг яблок нужно 300 грамм сахара
ценасахар=колвосахар/1000*0.99
#цена сахара 0,99 центов за 1 кг
колвовода=apples/10
#на 1кг яблок нужно 100 миллилитров воды
ценавода=колвовода*0.60
#цена воды 60 центов за литр

print("Кол-во корицы =", колвокорицы, "грамм")
print("Цена корицы =", ценакорицы, "евро")
print("Кол-во сахара =", колвосахар, "грамм")
print("Цена сахара =", ценасахар, "евро")
print("Кол-во воды =", колвовода, "литров")
print("Цена воды =", ценавода, "евро")

общаяцена=ценавода+ценасахар+ценакорицы
print("Цена варенья =", общаяцена, "евро")
